Repository: O5mu/GPACalculator
Catalog: GPACalculator/Localizable.xcstrings
Source language: en
Languages: ar

source: %lld credit hours
ar: %lld ساعة معتمدة

source: Academic Warning
ar: إنذار أكاديمي

source: Add Course
ar: إضافة مادة

source: Add your courses and grades to calculate your GPA.
ar: أضف موادك وتقديراتك لحساب معدلك.

source: Cancel
ar: إلغاء

source: Change Language
ar: تغيير اللغة

source: Choose English or Arabic for this app in Settings.
ar: اختر العربية أو الإنجليزية لهذا التطبيق من الإعدادات.

source: Choose the scale your university uses.
ar: اختر نظام المعدل المعتمد في جامعتك.

source: Completed Hours
ar: الساعات المنجزة

source: Course Name
ar: اسم المادة

source: Courses
ar: المواد

source: Credit Hours
ar: الساعات المعتمدة

source: Cumulative
ar: التراكمي

source: Cumulative GPA
ar: المعدل التراكمي

source: Delete Course
ar: حذف المادة

source: Done
ar: تم

source: Edit Course
ar: تعديل المادة

source: Enter your current cumulative GPA and completed hours to see your new cumulative GPA.
ar: أدخل معدلك التراكمي الحالي وساعاتك المنجزة لمعرفة معدلك التراكمي الجديد.

source: Excellent
ar: ممتاز

source: Good
ar: جيد

source: GPA
ar: المعدل

source: GPA Calculator
ar: حاسبة المعدل

source: Grade
ar: التقدير

source: Grade Points
ar: نقاط التقديرات

source: Grading Scale
ar: نظام المعدل

source: Hours
ar: الساعات

source: Language
ar: اللغة

source: New Course
ar: مادة جديدة

source: No Courses Yet
ar: لا توجد مواد بعد

source: out of %@
ar: من %@

source: Out of %@
ar: من %@

source: Pass
ar: مقبول

source: Points
ar: النقاط

source: Previous Semesters
ar: الفصول السابقة

source: Remove All Courses
ar: حذف جميع المواد

source: Remove all courses?
ar: حذف جميع المواد؟

source: Save
ar: حفظ

source: Semester GPA
ar: المعدل الفصلي

source: Settings
ar: الإعدادات

source: This can't be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Untitled Course
ar: مادة بدون اسم

source: Very Good
ar: جيد جدًا

source: Add courses or your previous record to plan from your current GPA.
ar: أضف موادك أو سجلك السابق للتخطيط بناءً على معدلك الحالي.

source: Aim for %@ or better in every course.
ar: استهدف %@ أو أعلى في كل مادة.

source: Below your target
ar: أقل من هدفك

source: Credit hours you plan to take before reaching your goal.
ar: الساعات المعتمدة التي تخطط لدراستها قبل الوصول إلى هدفك.

source: Current GPA
ar: المعدل الحالي

source: Goal Planner
ar: مخطط الهدف

source: Goal Secured
ar: الهدف مضمون

source: If You Average
ar: إذا كان متوسط تقديراتك

source: in your next %lld credit hours
ar: خلال %lld ساعة معتمدة قادمة

source: is the highest you can reach in these hours, even with top grades. Try more hours or a lower target.
ar: هو أعلى معدل يمكنك الوصول إليه خلال هذه الساعات حتى مع أعلى التقديرات. جرّب ساعات أكثر أو هدفًا أقل.

source: Meets your target
ar: يحقق هدفك

source: Out of Reach
ar: بعيد المنال

source: See what you need to reach your target GPA.
ar: اعرف ما تحتاجه للوصول إلى معدلك المستهدف.

source: Target %@
ar: الهدف %@

source: Target GPA
ar: المعدل المستهدف

source: Upcoming Hours
ar: الساعات القادمة

source: Within Reach
ar: في المتناول

source: You need an average of
ar: تحتاج إلى متوسط

source: You'll stay at or above your target even with the lowest grades.
ar: ستبقى عند هدفك أو أعلى منه حتى مع أدنى التقديرات.

source: Your cumulative GPA after the upcoming hours if you average each grade.
ar: معدلك التراكمي بعد الساعات القادمة لو كان متوسط تقديراتك بكل تقدير من هذه.
